app/views/fruits/show.html.erb


  <%= f.hidden_field :fruit_id, :value => Fruit.find(params[:id]).id %>
---
SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]