app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 1]]
---
  def index
        @appointments = current_user.appointments.all

INSERT INTO "appointments" ("location", "notes", "user_id", "fruit_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["location", "here"], ["notes", "none"], ["user_id", 2], ["fruit_id", 2], ["created_at", "2017-10-17 17:51:00.296118"], ["updated_at", "2017-10-17 17:51:00.296118"]]
---
        def create

          @appointment = current_user.appointments.create!(appointment_params)

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        def show
          @appointment = Appointment.find(params[:id])

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
        def edit
          @appointment = Appointment.find(params[:id])

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "appointments" SET "location" = $1, "notes" = $2, "updated_at" = $3 WHERE "appointments"."id" = $4  [["location", "Starbucks (15th and Main Street)"], ["notes", "Call for Reservations"], ["updated_at", "2017-10-17 17:58:21.104261"], ["id", 2]]
---
        def update
          @appointment = Appointment.find(params[:id])
          @appointment.update(appointment_params)

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = $1  [["id", 2]]
---
        def destroy
          @appointment = Appointment.find(params[:id])
          @appointment.destroy