app/controllers/fruits_controller.rb

SELECT "fruits".* FROM "fruits" WHERE "fruits"."user_id" = $1  [["user_id", 1]]
---
       def index
        @fruits = current_user.fruits.all

INSERT INTO "fruits" ("name", "phone", "email", "location", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
        def create
          @fruit = current_user.fruits.create!(fruit_params)

SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."user_id" = $1  [["user_id", 1]]
---
        def show
          @fruit = Fruit.find(params[:id])
          @appointments = current_user.appointments.all

SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
        def edit
          @fruit = Fruit.find(params[:id])

SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "fruits" SET "description" = $1, "updated_at" = $2 WHERE "fruits"."id" = $3  [["description", "There's nothing that exciting about him"], ["updated_at", "2017-09-20 14:46:49.065605"], ["id", 3]]
---
        def update
          @fruit = Fruit.find(params[:id])
          @fruit.update(fruit_params)

SELECT  "fruits".* FROM "fruits" WHERE "fruits"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "fruits" WHERE "fruits"."id" = $1  [["id", 5]]
---
        def destroy
          @fruit = Fruit.find(params[:id])
          @fruit.destroy